CREATE TABLE IF NOT EXISTS landmarks
(
    id BIGINT AUTO_INCREMENT PRIMARY KEY,
    landmark_name VARCHAR(128) NOT NULL,
    latitude DECIMAL(7, 5) NOT NULL,
    longitude DECIMAL(8, 5) NOT NULL
);

INSERT INTO landmarks (landmark_name, longitude, latitude) VALUES
('서울대입구역 3번 출구', 126.95244, 37.48070),
('낙성대역 버스정류장', 126.96242, 37.47779),
('낙성대입구 버스정류장', 126.96188,37.47791),
('대학동고시촌입구 버스정류장(녹두)', 126.93838, 37.47054),
('사당역 4번 출구', 126.98148, 37.47500),
('경영대.행정대학원 버스정류장', 126.95205, 37.46614),
('자연대.행정관입구 버스정류장', 126.94896, 37.45999),
('법대.사회대입구 버스정류장', 126.94908, 37.46326),
('농생대 버스정류장', 126.94917, 37.45716),
('공대입구 버스정류장(글로벌공학교육센터)', 126.94984, 37.45493),
('제2공학관(302동) 버스정류장', 126.95208, 37.44880),
('학부생활관 버스정류장', 126.95807, 37.46375),
('수의대입구.보건대학원앞 버스정류장', 126.95463, 37.46612),
('기숙사 삼거리', 126.95677, 37.46046),
('국제대학원', 126.95526, 37.46418);


